app/views/opinions/_opinion.html.erb

                    <p class="tweet-comment"><%= opinion.text %></p>
                    <p class="likes-bar"><%= pluralize(opinion.likes.count, "like") %></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."opinion_id" = $1  [["opinion_id", 3]]