app/helpers/opinions_helper.rb

	 def liked?(opinion_id)
    current_user.likes.exists?(opinion_id: opinion_id)
---
SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."opinion_id" = $2 LIMIT $3  [["user_id", 2], ["opinion_id", 2], ["LIMIT", 1]]

  def current_user_liked(opinion_id)
    current_user.likes.find_by(opinion_id: opinion_id).id
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."opinion_id" = $2 LIMIT $3  [["user_id", 2], ["opinion_id", 2], ["LIMIT", 1]]