app/controllers/followings_controller.rb

INSERT INTO "followings" ("user_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["follower_id", 1], ["created_at", "2020-05-01 18:59:08.808719"], ["updated_at", "2020-05-01 18:59:08.808719"]]
---
  def create
    @following = Following.new(followings_params)
    @following.save