app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "opinion_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["opinion_id", 2], ["created_at", "2020-05-01 19:15:44.630369"], ["updated_at", "2020-05-01 19:15:44.630369"]]
---
  def create
    @like = Like.new(likes_params)
    redirect_back(fallback_location: root_path) if @like.save