app/controllers/opinions_controller.rb

INSERT INTO "opinions" ("text", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "My Love"], ["author_id", 1], ["created_at", "2020-04-27 23:10:14.319953"], ["updated_at", "2020-04-27 23:10:14.319953"]]
---
  def create
    @opinion = current_user.opinions.build(opinions_params)
    @opinion.author = current_user
    if @opinion.save

SELECT "opinions".* FROM "opinions" ORDER BY "opinions"."created_at" DESC
SELECT "users".* FROM "users" WHERE 1=1
---
  def index
    @opinion = Opinion.new
    @opinions = Opinion.all
    @nofollowers = User.where.not(id: current_user.followers)