app/controllers/static_pages_controller.rb

  def connect
  	@nofollowers = User.where.not(id: current_user.followers)
---
SELECT "users".* FROM "users" WHERE 1=1