app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "maxben"], ["email", "mike@gmail.com"], ["created_at", "2020-04-27 17:46:10.755849"], ["updated_at", "2020-04-27 17:46:10.755849"]]
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT "opinions".* FROM "opinions" ORDER BY "opinions"."created_at" DESC
---
	def show
		@user = current_user
		@opinions = Opinion.all