app/models/user.rb

  def following
    inverse_followings.map{|following| following.user }
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]